namespace A06._1_Graph;

class Program
{
    static void Main()
    {
        double[,] arr = new double[,]
        {
            {0, 1, 1, 1 ,0, 0, 0, 0},
            {1, 0, 1, 1, 1, 0, 0 ,0},
            {1, 1, 0, 1, 0, 1, 0, 0},
            {1, 1, 1, 0, 1, 1, 1, 1},
            {0, 1, 0, 1, 0, 0, 0, 1},
            {0, 0, 1, 1, 0, 0, 1, 1},
            {0, 0, 0, 1, 0, 1, 0, 1},
            {0, 0, 0, 1, 1, 1, 1, 0}
        };

        Graph g = new Graph(arr);
        
        g.BFS(0);

        Console.WriteLine(g.RoadsNumber() + "roads");
        
        //представить некий неориентированный граф как множество город и дорог между нми матрицей смежности
        //посчитайте количество дорог между всеми городами
    }
}